---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceType
source: html/2c61004d-2303-06f9-4b17-0814d9509caa.htm
---
# ExternalResourceType Members

Creates a new ExternalResourceType instance.